Terraform Plan:

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.gh_actions_assume_role_policy will be created
  + resource "aws_iam_policy" "gh_actions_assume_role_policy" {
      + arn         = (known after apply)
      + description = "Policy for GH Actions Assume Role"
      + id          = (known after apply)
      + name        = "gh-policy-prod-01"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:Describe*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.gh_actions_assume_role will be created
  + resource "aws_iam_role" "gh_actions_assume_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gh-actions-prod-role-01"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/tfplan/iac_prod_infra_iam.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/tfplan/iac_prod_infra_iam.tfplan"
stdout<<ghadelimiter_b0fd992f-e9c4-4c0a-88c1-200631b2a7df

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.gh_actions_assume_role_policy will be created
  + resource "aws_iam_policy" "gh_actions_assume_role_policy" {
      + arn         = (known after apply)
      + description = "Policy for GH Actions Assume Role"
      + id          = (known after apply)
      + name        = "gh-policy-prod-01"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:Describe*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.gh_actions_assume_role will be created
  + resource "aws_iam_role" "gh_actions_assume_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gh-actions-prod-role-01"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/tfplan/iac_prod_infra_iam.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/tfplan/iac_prod_infra_iam.tfplan"

ghadelimiter_b0fd992f-e9c4-4c0a-88c1-200631b2a7df
stderr<<ghadelimiter_d7a34c92-fd4b-42bf-adfa-988693b10ad0

ghadelimiter_d7a34c92-fd4b-42bf-adfa-988693b10ad0
exitcode<<ghadelimiter_b5768f67-3b91-44ae-ae21-c40d1564bf1b
0
ghadelimiter_b5768f67-3b91-44ae-ae21-c40d1564bf1b
```